Revit 2024 API
LinkOriginFileType Enumeration
 Enum determining whether the source type of a temporary rvt link is an ifc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Since: 2022
Syntax
C#
public enum LinkOriginFileType
Visual Basic
Public Enumeration LinkOriginFileType
Visual C++
public enum class LinkOriginFileType
Members
Member name | Description
RVT |  Default RVT, curently only support ifc.
IFC |  The original link file is an ifc file.
See Also
Autodesk.Revit.DB Namespace